//-----------------------------------------
// ----------- ДОМАШНЯЯ РАБОТА 9 ----------
//-----------------------------------------

//-----Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

int FindSumDigit(int m, int n)  
{
    if(m < n) return FindSumDigit(m+1,n)+m;
    else return m;
}
Console.Write(FindSumDigit(1,10));